//=============================================================================
//
// スコアの定義 [score.cpp]
// Author :齋藤大行
//
//=============================================================================

//=============================================================================
//二重インクルード防止
//=============================================================================
#ifndef _SCORE_H_
#define _SCORE_H_
#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "scene.h"
#include "number.h"

//=============================================================================
// クラス宣言
//=============================================================================
class CScore : public CScene//スコアクラス
{
public:
	CScore();					//コントラクタ
	~CScore();					//デストラクタ
	static CScore *Create(void);	//作成処理
	HRESULT Init(void);				//初期化処理
	void Uninit(void);			//終了処理
	void Update(void);			//更新処理
	void Draw(void);			//描画処理
	void AddScore(int nScore);  //スコア設定
	

private:
	CNumber *m_apNumber[MAX_NUM];	//Numberのポインタ
	int m_nScore;					//スコア値
protected:


};

#endif
