//=============================================================================
//
// TCPサーバー定義 [tcp_server.h]
// Author :齋藤大行
//
//=============================================================================
#ifndef _TCP_SERVER_H_
#define _TCP_SERVER_H_
#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
//インクルードファイル
//=============================================================================
#include<WinSock2.h>
#include<stdio.h>

//=============================================================================
//マクロ定義
//=============================================================================

//=============================================================================
//前方宣言
//=============================================================================
class CTcpClient;

//=============================================================================
//クラス定義
//=============================================================================
class CTcpListener
{
public:
	CTcpListener();										//コンストラクタ
	~CTcpListener();									//デストラクタ
	static CTcpListener *Create(int nPortNum);			//生成処理
	CTcpClient *Accept(void);							//接続受付処理
	void Release(void);									//終了判定
	bool Init(int nPortNum, int nAcceptConnNum);		//初期化処理
	void Close();										//終了処理

private:
	SOCKET m_sockServer;
};         


#endif 
